Replace all mermaid diagrams with graphviz.
Requires updated mdslides binary.
